betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/Phy/Src/stm32wl3_wMBus_Phy_radio.c
/**
  ******************************************************************************
  * @file    stm32wl3_wMBus_Phy_radio.c
  * @author  MCD Application Team
  * @brief   wM-Bus Phy Radio module driver.
  *          This file provides firmware functions to manage the Radio module
  *          of the wM-Bus Phy driver
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x_hal.h"
#include "stm32wl3_wMBus_Phy_radio.h"
#include "stm32wl3_wMBus_Phy_pwr.h"

/** @addtogroup STM32WL3_wM-Bus
  * @{
  */

/** @addtogroup Phy
  * @{
  */

/** @addtogroup Radio
  * @{
  */

/** @defgroup Radio_Private_Constants Radio Private Constants
  * @{
  */
#define WMBUS_FIRST_BLOCK_SIZE_FORMAT_A 12 /**< First block size for format A */
#define WMBUS_FIRST_BLOCK_SIZE_FORMAT_B 10 /**< First block size for format B */

#define WMBUS_SECOND_BLOCK_MAX_SIZE_FORMAT_B 118 /**< Maximum size of the second block for format B, including CRC */

#ifdef WMBUS_FIRST_CRC_CHECK                                // only valid for frame format A
#define WMBUS_FIRST_RXBUFFER_THRESHOLD_TMODE_FFA 12         /**< First RX buffer threshold for T-mode, frame format A */
#define WMBUS_FIRST_RXBUFFER_THRESHOLD_CMODE_FFA 12         /**< First RX buffer threshold for C-mode, frame format A */
#define WMBUS_FIRST_RXBUFFER_THRESHOLD_CMODE_FF_DYNAMCIC 13 /**< First RX buffer threshold for C-mode, dynamic frame format */
#define WMBUS_FIRST_RXBUFFER_THRESHOLD_SMODE_FFA 12         /**< First RX buffer threshold for S-mode, frame format A */
#define WMBUS_FIRST_RXBUFFER_THRESHOLD_NMODE_FFA 12         /**< First RX buffer threshold for N-mode, frame format A */
#define WMBUS_FIRST_RXBUFFER_THRESHOLD_CTMODE_FF_DYNAMIC 18 /**< First RX buffer threshold for CT mode, dynamic frame format */
#if !defined(T1C1_ACTIVATED) && !defined(T1C1_ACTIVATED_C1_MODE)
#define WMBUS_FIRST_RXBUFFER_THRESHOLD WMBUS_FIRST_RXBUFFER_THRESHOLD_CMODE_FF_DYNAMCIC /**< Maximum value for the number of RX bytes to receive, for C-mode dynamic frame format */
#else
#define WMBUS_FIRST_RXBUFFER_THRESHOLD WMBUS_FIRST_RXBUFFER_THRESHOLD_CTMODE_FF_DYNAMIC /**< Maximum value for the number of RX bytes to receive, for CT-mode dynamic frame format */
#endif
#endif

#ifndef CLKREC_PLL_MODE
#define RSSI_THRESHOLD -111 /**< RSSI threshold if CLKREC_PLL_MODE is not defined */
#else
#define RSSI_THRESHOLD -105 /**< RSSI threshold if CLKREC_PLL_MODE is defined */
#endif

#define CRC_POLYNOM 0x3D65 /**< CRC polynomial for wM-Bus Phy Radio */

#ifdef WMBUS_DEBUG
#define WMBUS_LOG_BUFFER_SIZE 100 /**< Size of the debug log buffer */
#endif

#define T_S_C_N2G_FAC_VALUE 2 /**< FAC value (N) for T, S, C modes: N = 2, 3 or 5 */
#define N2A_N2F_FAC_VALUE 5   /**< FAC value (N) for T, S, C modes: N = 5, 7 or 13 */
/**
  * @}
  */

/** @defgroup Radio_Private_Macros Radio Private Macros
  * @{
  */
#define CEILING(X) (X - (uint16_t)(X) > 0 ? (uint16_t)(X + 1) : (uint16_t)(X)) /**< Ceiling function */
/**
  * @}
  */

/** @defgroup Radio_Private_Variables Radio Private Variables
  * @{
  */
/**
  * @brief Define frequencies depending on mode and direction.
  */
const uint32_t wMBus_Phy_Frequency[WMBUS_MODE_NUMBER][2] =
{
  {868950000, 868300000}, /**< T-mode: M2O = 868950000 Hz, O2M = 868300000 Hz */
  {868300000, 868300000}, /**< S-mode: M2O = 868300000 Hz, O2M = 868300000 Hz */
  {868300000, 868300000}, /**< S1M-mode: M2O = 868300000 Hz, O2M = 868300000 Hz */
  {868950000, 869525000}, /**< C-mode: M2O = 868950000 Hz, O2M = 869525000 Hz */
  {169406250, 169406250}, /**< N-mode - N1a, N2a: M2O = 169406250 Hz, O2M = 169406250 Hz */
  {169418750, 169418750}, /**< N-mode - N1b, N2b: M2O = 169418750 Hz, O2M = 169418750 Hz */
  {169431250, 169431250}, /**< N-mode - N1c, N2c: M2O = 169431250 Hz, O2M = 169431250 Hz */
  {169443750, 169443750}, /**< N-mode - N1d, N2d: M2O = 169443750 Hz, O2M = 169443750 Hz */
  {169456250, 169456250}, /**< N-mode - N1e, N2e: M2O = 169456250 Hz, O2M = 169456250 Hz */
  {169468750, 169468750}, /**< N-mode - N1f, N2f: M2O = 169468750 Hz, O2M = 169468750 Hz */
  {169437500, 169437500}  /**< N-mode - N2g: M2O = 169437500 Hz, O2M = 169437500 Hz */
};

/**
  * @brief Define data rates depending on mode and direction.
  */
const uint32_t wMBus_Phy_Datarate[WMBUS_MODE_NUMBER][2] =
{
  {100000, 32768}, /**< T-mode: M2O = 100000 bps, O2M = 32768 bps */
  {32768, 32768},  /**< S-mode: M2O = 32768 bps, O2M = 32768 bps */
  {32768, 32768},  /**< S1M-mode: M2O = 32768 bps, O2M = 32768 bps */
  {100000, 50000}, /**< C-mode: M2O = 100000 bps, O2M = 50000 bps */
  {4800, 4800},    /**< N-mode - N1a, N2a: M2O = 4800 bps, O2M = 4800 bps */
  {4800, 4800},    /**< N-mode - N1b, N2b: M2O = 4800 bps, O2M = 4800 bps */
  {2400, 2400},    /**< N-mode - N1c, N2c: M2O = 2400 bps, O2M = 2400 bps */
  {2400, 2400},    /**< N-mode - N1d, N2d: M2O = 2400 bps, O2M = 2400 bps */
  {4800, 4800},    /**< N-mode - N1e, N2e: M2O = 4800 bps, O2M = 4800 bps */
  {4800, 4800},    /**< N-mode - N1f, N2f: M2O = 4800 bps, O2M = 4800 bps */
  {9600, 9600}     /**< N-mode - N2g 4-GFSK symbol rate: M2O = 4800 bps, O2M = 4800 bps */
};

/**
  * @brief Define frequency deviation depending on mode and direction.
  */
const uint32_t wMBus_Phy_FreqDev[WMBUS_MODE_NUMBER][2] =
{
  {50000, 50000}, /**< T-mode: M2O = 50 kHz, O2M = 50 kHz */
  {50000, 50000}, /**< S-mode: M2O = 50 kHz, O2M = 50 kHz */
  {50000, 50000}, /**< S1M-mode: M2O = 50 kHz, O2M = 50 kHz */
  {45000, 25000}, /**< C-mode: M2O = 45 kHz, O2M = 25 kHz */
  {2400, 2400},   /**< N-mode - N1a, N2a: M2O = 2.4 kHz, O2M = 2.4 kHz */
  {2400, 2400},   /**< N-mode - N1b, N2b: M2O = 2.4 kHz, O2M = 2.4 kHz */
  {2400, 2400},   /**< N-mode - N1c, N2c: M2O = 2.4 kHz, O2M = 2.4 kHz */
  {2400, 2400},   /**< N-mode - N1d, N2d: M2O = 2.4 kHz, O2M = 2.4 kHz */
  {2400, 2400},   /**< N-mode - N1e, N2e: M2O = 2.4 kHz, O2M = 2.4 kHz */
  {2400, 2400},   /**< N-mode - N1f, N2f: M2O = 2.4 kHz, O2M = 2.4 kHz */
  {7200, 7200}    /**< N-mode - N2g: M2O = 7.2 kHz, O2M = 7.2 kHz */
};

/**
  * @brief Define modulation type depending on mode and direction.
  */
const MRSubGModSelect wMBus_Phy_Modulation[WMBUS_MODE_NUMBER][2] =
{
  {MOD_2FSK, MOD_2FSK},       /**< T-mode: M2O = 2-FSK, O2M = 2-FSK */
  {MOD_2FSK, MOD_2FSK},       /**< S-mode: M2O = 2-FSK, O2M = 2-FSK */
  {MOD_2FSK, MOD_2FSK},       /**< S1M-mode: M2O = 2-FSK, O2M = 2-FSK */
  {MOD_2FSK, MOD_2GFSK05},    /**< C-mode: M2O = 2-FSK, O2M = 2GFSK BT = 0.5 */
  {MOD_2GFSK05, MOD_2GFSK05}, /**< N-mode - N1a, N2a: M2O = 2GFSK BT = 0.5, O2M = 2GFSK BT = 0.5 */
  {MOD_2GFSK05, MOD_2GFSK05}, /**< N-mode - N1b, N2b: M2O = 2GFSK BT = 0.5, O2M = 2GFSK BT = 0.5 */
  {MOD_2GFSK05, MOD_2GFSK05}, /**< N-mode - N1c, N2c: M2O = 2GFSK BT = 0.5, O2M = 2GFSK BT = 0.5 */
  {MOD_2GFSK05, MOD_2GFSK05}, /**< N-mode - N1d, N2d: M2O = 2GFSK BT = 0.5, O2M = 2GFSK BT = 0.5 */
  {MOD_2GFSK05, MOD_2GFSK05}, /**< N-mode - N1e, N2e: M2O = 2GFSK BT = 0.5, O2M = 2GFSK BT = 0.5 */
  {MOD_2GFSK05, MOD_2GFSK05}, /**< N-mode - N1f, N2f: M2O = 2GFSK BT = 0.5, O2M = 2GFSK BT = 0.5 */
  {MOD_4GFSK05, MOD_4GFSK05}  /**< N-mode - N2g: M2O = 4GFSK BT = 0.5, O2M = 4GFSK BT = 0.5 */
};

/**
  * @brief Define channel bandwidth depending on mode and direction.
  */
const uint32_t wMBus_Phy_ChannelBandwidth[WMBUS_MODE_NUMBER][2] =
{
#ifndef WMBUS_T_MODE_PERFORMANCE_FREQ_OFFSET
  {250000, 200000}, /**< T-mode if WMBUS_T_MODE_PERFORMANCE_FREQ_OFFSET is not defined: M2O = 250 kHz, O2M = 200 kHz */
#else
#ifndef CLKREC_PLL_MODE
  {270000, 270000}, /**< T-mode if WMBUS_T_MODE_PERFORMANCE_FREQ_OFFSET is defined and CLKREC_PLL_MODE is not defined: M2O = 270 kHz, O2M = 270 kHz */
#else
  {300000, 300000}, /**< T-mode if WMBUS_T_MODE_PERFORMANCE_FREQ_OFFSET is defined and CLKREC_PLL_MODE is defined: M2O = 300 kHz, O2M = 300 kHz */
#endif
#endif
  {150000, 150000}, /**< S-mode: M2O = 150 kHz, O2M = 150 kHz */
  {150000, 150000}, /**< S1M-mode: M2O = 150 kHz, O2M = 150 kHz */
  {200000, 125000}, /**< C-mode: M2O = 200 kHz, O2M = 125 kHz */
  {10000, 10000},   /**< N-mode - N1a, N2a: M2O = 10 kHz, O2M = 10 kHz */
  {10000, 10000},   /**< N-mode - N1b, N2b: M2O = 10 kHz, O2M = 10 kHz */
  {10000, 10000},   /**< N-mode - N1c, N2c: M2O = 10 kHz, O2M = 10 kHz */
  {10000, 10000},   /**< N-mode - N1d, N2d: M2O = 10 kHz, O2M = 10 kHz */
  {10000, 10000},   /**< N-mode - N1e, N2e: M2O = 10 kHz, O2M = 10 kHz */
  {10000, 10000},   /**< N-mode - N1f, N2f: M2O = 10 kHz, O2M = 10 kHz */
  {40000, 40000}    /**< N-mode - N2g: M2O = 40 kHz, O2M = 40 kHz */
};

/**
  * @brief Define the number of times the standard preamble sequence shall be repeated depending on mode and direction.
  */
const uint16_t wMBus_Phy_PreambleLength[WMBUS_MODE_NUMBER][2] =
{
  {12, 15},  /**< T-mode: M2O = 12, O2M = 15 */
  {276, 15}, /**< S-mode: M2O = 276, O2M = 15 */
  {12, 15},  /**< S1M-mode: M2O = 12, O2M = 15 */
  {16, 16},  /**< C-mode: M2O = 16, O2M = 16 */
  {8, 8},    /**< N-mode - N1a, N2a: M2O = 8, O2M = 8 */
  {8, 8},    /**< N-mode - N1b, N2b: M2O = 8, O2M = 8 */
  {8, 8},    /**< N-mode - N1c, N2c: M2O = 8, O2M = 8 */
  {8, 8},    /**< N-mode - N1d, N2d: M2O = 8, O2M = 8 */
  {8, 8},    /**< N-mode - N1e, N2e: M2O = 8, O2M = 8 */
  {8, 8},    /**< N-mode - N1f, N2f: M2O = 8, O2M = 8 */
  {8, 8}     /**< N-mode - N2g 4-GFSK preamble pattern: 8x(0111): M2O = 8, O2M = 8 */
};

/**
  * @brief Define sync length depending on mode and direction.
  * on gateway side better to align to 24-bit Sync pattern for Meter to Other direction
  */
const uint8_t wMBus_Phy_SyncLength[WMBUS_MODE_NUMBER][2] =
{
  {24, 18}, /**< T-mode: M2O = 24, O2M = 18 */
  {24, 18}, /**< S-mode: M2O = 24, O2M = 18 */
  {24, 18}, /**< S1M-mode: M2O = 24, O2M = 18 */
  {32, 32}, /**< C-mode: M2O = 32, O2M = 32 */
  {16, 16}, /**< N-mode - N1a, N2a: M2O = 16, O2M = 16 */
  {16, 16}, /**< N-mode - N1b, N2b: M2O = 16, O2M = 16 */
  {16, 16}, /**< N-mode - N1c, N2c: M2O = 16, O2M = 16 */
  {16, 16}, /**< N-mode - N1d, N2d: M2O = 16, O2M = 16 */
  {16, 16}, /**< N-mode - N1e, N2e: M2O = 16, O2M = 16 */
  {16, 16}, /**< N-mode - N1f, N2f: M2O = 16, O2M = 16 */
  {32, 32}  /**< N-mode - N2g specific setting with FORCE_2FSK_SYNC_MODE bit enabled: M2O = 32, O2M = 32 */
};

/**
  * @brief Define sync pattern depending on mode and direction.
  */
const uint32_t wMBus_Phy_SyncPattern[WMBUS_MODE_NUMBER][2] =
{
  {0x55543D00, 0x1DA58000}, /**< T-mode: M2O = 0x55543D00, O2M = 0x1DA58000 */
  {0x54769600, 0x1DA58000}, /**< S-mode: M2O = 0x54769600, O2M = 0x1DA58000 */
  {0x54769600, 0x1DA58000}, /**< S1M-mode: M2O = 0x54769600, O2M = 0x1DA58000 */
  {0x543D54CD, 0x543D54CD}, /**< C-mode: M2O = 0x543D54CD, O2M = 0x543D54CD */
  {0xF68D0000, 0xF68D0000}, /**< N-mode - N1a, N2a: M2O = 0xF68D0000, O2M = 0xF68D0000 */
  {0xF68D0000, 0xF68D0000}, /**< N-mode - N1b, N2b: M2O = 0xF68D0000, O2M = 0xF68D0000 */
  {0xF68D0000, 0xF68D0000}, /**< N-mode - N1c, N2c: M2O = 0xF68D0000, O2M = 0xF68D0000 */
  {0xF68D0000, 0xF68D0000}, /**< N-mode - N1d, N2d: M2O = 0xF68D0000, O2M = 0xF68D0000 */
  {0xF68D0000, 0xF68D0000}, /**< N-mode - N1e, N2e: M2O = 0xF68D0000, O2M = 0xF68D0000 */
  {0xF68D0000, 0xF68D0000}, /**< N-mode - N1f, N2f: M2O = 0xF68D0000, O2M = 0xF68D0000 */
  {0xFF7DD5F7, 0xFF7DD5F7}  /**< N-mode - N2g: M2O = 0xFF7DD5F7, O2M = 0xFF7DD5F7 */
};

/**
  * @brief Define channel coding depending on mode and direction.
  */
const uint8_t wMBus_Phy_ChannelCoding[WMBUS_MODE_NUMBER][2] =
{
  {CODING_3o6, CODING_MANCHESTER},        /**< T-mode: M2O = 3 out of 6, O2M = Manchester */
  {CODING_MANCHESTER, CODING_MANCHESTER}, /**< S-mode: M2O = Manchester, O2M = Manchester */
  {CODING_MANCHESTER, CODING_MANCHESTER}, /**< S1M-mode: M2O = Manchester, O2M = Manchester */
  {CODING_NONE, CODING_NONE},             /**< C-mode: M2O = None, O2M = None */
  {CODING_NONE, CODING_NONE},             /**< N-mode - N1a, N2a: M2O = None, O2M = None */
  {CODING_NONE, CODING_NONE},             /**< N-mode - N1b, N2b: M2O = None, O2M = None */
  {CODING_NONE, CODING_NONE},             /**< N-mode - N1c, N2c: M2O = None, O2M = None */
  {CODING_NONE, CODING_NONE},             /**< N-mode - N1d, N2d: M2O = None, O2M = None */
  {CODING_NONE, CODING_NONE},             /**< N-mode - N1e, N2e: M2O = None, O2M = None */
  {CODING_NONE, CODING_NONE},             /**< N-mode - N1f, N2f: M2O = None, O2M = None */
  {CODING_NONE, CODING_NONE},             /**< N-mode - N2g: M2O = None, O2M = None */
};

#ifdef WMBUS_RX_PERFORMANCE_ENABLED
/**
  * @brief Define optimized Rx RSSI thresholds depending on mode and direction.
  *        Register values assuming 0x00 => -160dBm with 1/2dB steps
  *        Example: decimal register value = 100 to obtain -110dbm
  * @note  This const is defined only if WMBUS_RX_PERFORMANCE_ENABLED is defined.
  */
const uint16_t wMBus_Phy_Rx_RssiThreshold[WMBUS_MODE_NUMBER][2] =
{
  {102, 98}, /**< T-mode: M2O = -109dBm, O2M = -111dBm */
  {98, 98},  /**< S-mode: M2O = -111dBm, O2M = -111dBm */
  {98, 98},  /**< S1M-mode: M2O = -111dBm, O2M = -111dBm */
  {98, 98},  /**< C-mode: M2O = -111dBm, O2M = -111dBm */
  {60, 60},  /**< N-mode - N1a, N2a: M2O = -130dBm, O2M = -130dBm */
  {60, 60},  /**< N-mode - N1b, N2b: M2O = -130dBm, O2M = -130dBm */
  {60, 60},  /**< N-mode - N1c, N2c: M2O = -130dBm, O2M = -130dBm */
  {60, 60},  /**< N-mode - N1d, N2d: M2O = -130dBm, O2M = -130dBm */
  {60, 60},  /**< N-mode - N1e, N2e: M2O = -130dBm, O2M = -130dBm */
  {60, 60},  /**< N-mode - N1f, N2f: M2O = -130dBm, O2M = -130dBm */
  {100, 100} /**< N-mode - N2g: M2O = -110dBm, O2M = -110dBm */
};

/**
  * @brief Define optimized Rx Clock Recovery values depending on mode and direction.
  *        Pair of values for CLK_REC0 and CLK_REC1 registers {CLK_REC0, CLK_REC1}.
  */
const uint8_t wMBus_Phy_Rx_ClkRec[WMBUS_MODE_NUMBER][2][2] =
{
  {{0x98, 0x18}, {0x98, 0x18}}, /**< T-mode, optimized values */
  {{0x98, 0x18}, {0x98, 0x18}}, /**< S-mode, optimized values */
  {{0xB8, 0x5C}, {0xB8, 0x5C}}, /**< S1M-mode, default values */
  {{0x98, 0x18}, {0x98, 0x18}}, /**< C-mode, optimized values */
  {{0xB8, 0x5C}, {0xB8, 0x5C}}, /**< N-mode - N1a, N2a, default values */
  {{0xB8, 0x5C}, {0xB8, 0x5C}}, /**< N-mode - N1b, N2b, default values */
  {{0xB8, 0x5C}, {0xB8, 0x5C}}, /**< N-mode - N1c, N2c, default values */
  {{0xB8, 0x5C}, {0xB8, 0x5C}}, /**< N-mode - N1d, N2d, default values */
  {{0xB8, 0x5C}, {0xB8, 0x5C}}, /**< N-mode - N1e, N2e, default values */
  {{0xB8, 0x5C}, {0xB8, 0x5C}}, /**< N-mode - N1f, N2f, default values */
  {{0x38, 0x5C}, {0x38, 0x5C}}  /**< N-mode - N2g, default values */
};
#endif

/**
  * @brief Define {Min, Max} Response delay (tRO) in us depending on mode.
  */
const uint32_t wMBus_Phy_responseDelay[WMBUS_MODE_NUMBER][2] =
{
  {2000, 3000},    /**< T-mode: Min = 2000us=2ms, Max = 3000us=3ms */
  {3000, 50000},   /**< S-mode: Min = 3000us=3ms, Max = 50000us=50ms */
  {3000, 50000},   /**< S1M-mode: Min = 3000us=3ms, Max = 50000us=50ms */
  {99500, 100500}, /**< C-mode: Min = 99500us=99.5ms, Max = 100500us=100.5ms */
  {99500, 100500}, /**< N-mode - N1a, N2a: Min = 99500us=99.5ms, Max = 100500us=100.5ms */
  {99500, 100500}, /**< N-mode - N1b, N2b: Min = 99500us=99.5ms, Max = 100500us=100.5ms */
  {99500, 100500}, /**< N-mode - N1c, N2c: Min = 99500us=99.5ms, Max = 100500us=100.5ms */
  {99500, 100500}, /**< N-mode - N1d, N2d: Min = 99500us=99.5ms, Max = 100500us=100.5ms */
  {99500, 100500}, /**< N-mode - N1e, N2e: Min = 99500us=99.5ms, Max = 100500us=100.5ms */
  {99500, 100500}, /**< N-mode - N1f, N2f: Min = 99500us=99.5ms, Max = 100500us=100.5ms */
  {99500, 100500}  /**< N-mode - N2g: Min = 99500us=99.5ms, Max = 100500us=100.5ms */
};

/**
  * @brief Define FAC transmission delay (tTxD) in us depending on mode.
  */
const uint32_t wMBus_Phy_FACTransmissionDelay[WMBUS_MODE_NUMBER] = 
{
  T_S_C_N2G_FAC_VALUE * 1000, /**< T-mode: N*1000us, N=2, 3 or 5 */
  T_S_C_N2G_FAC_VALUE * 1000, /**< S-mode: N*1000us, N=2, 3 or 5 */
  0,                          /**< S1M-mode: not exists */
  T_S_C_N2G_FAC_VALUE * 1000, /**< C-mode: N*1000us, N=2, 3 or 5 */
  N2A_N2F_FAC_VALUE * 1000,   /**< N-mode - N2a: N*1000us, N=5, 7 or 13 */
  N2A_N2F_FAC_VALUE * 1000,   /**< N-mode - N2b: N*1000us, N=5, 7 or 13 */
  N2A_N2F_FAC_VALUE * 1000,   /**< N-mode - N2c: N*1000us, N=5, 7 or 13 */
  N2A_N2F_FAC_VALUE * 1000,   /**< N-mode - N2d: N*1000us, N=5, 7 or 13 */
  N2A_N2F_FAC_VALUE * 1000,   /**< N-mode - N2e: N*1000us, N=5, 7 or 13 */
  N2A_N2F_FAC_VALUE * 1000,   /**< N-mode - N2f: N*1000us, N=5, 7 or 13 */
  T_S_C_N2G_FAC_VALUE * 1000  /**< N-mode - N2g: N*1000us, N=2, 3 or 5 */
};

SMRSubGConfig_t wMBus_Phy_RadioInitStruct = {0};

