betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/Phy/Src/stm32wl3_wMBus_Phy_radio.c
MRSubG_PcktBasicFields_t wMBus_Phy_PacketSettingsStruct = {0};

volatile FlagStatus xRxDoneFlag = RESET;
volatile FlagStatus xSabortCompletedFlag = RESET;

static uint8_t wMBus_Auto_Rx = 0;                                                        /**< Variable to relaunch Rx automatically: 0= not automatically relaunched, 1 = automatically relaunched */
static uint8_t vectcRadioBuff[WMBUS_RADIO_BUFFER_SIZE + WMBUS_RADIO_BUFFER_SIZE_MARGIN]; /**< Radio buffer directly connected to Radio IP */
static uint8_t vectcRadioBuff_copy[WMBUS_RADIO_BUFFER_SIZE_MAX_NRZ];                     /**< Radio buffer copy - used for vectcRadioBuff[] buffer manipulation - especially if T1C1_ACTIVATED */

volatile uint8_t xRxState = SM_RX_NEW_PACKET;

static uint16_t RssiOnSync = 0; /**< Rssi level measured once Sync is done */
static uint16_t RssiRxDone = 0; /**< RssiOnSync to be copied into RssiRxDone at the end of reception */

static uint32_t RxSync_Ongoing = 0; /**< Save Sync pattern during Rx */
static uint32_t RxSync_RxDone = 0;  /**< RxSync_Ongoing to be copied into RxSync_RxDone at the end of reception */

static uint8_t cLField; /**< L-field value */

static uint16_t nPcktLength = 0; /**< Packet length variable*/
#if defined(T1C1_ACTIVATED) || defined(T1C1_ACTIVATED_C1_MODE)
static uint16_t nPcktLengthRaw = 0; /**< Packet length variable for T1C1 mode */
#endif

#if defined(T1C1_ACTIVATED) || defined(T1C1_ACTIVATED_C1_MODE) || defined(AUTOMATIC_FORMAT_DETECTION_C_MODE)
static uint8_t wMBus_mode_global = 0;   /*< Global copy of wM-Bus configuration - mode */
#endif
static uint8_t wMBus_Format_global = 0; /*< Global copy of wM-Bus configuration - frame format */

static uint32_t wMBus_Radio_Event_bitmap = 0; /**< Bitmap of wM-Bus Radio events */

static uint8_t *global_buffer_ptr;        /**< Global buffer pointer */
static uint16_t *global_buffer_size_ptr;  /**< Global buffer size pointer */
static uint16_t global_buffer_allocation; /**< Global buffer allocation */
static uint8_t *global_buffer_format_ptr; /**< Global buffer format pointer */
static int32_t *global_RssiDbm_ptr;       /**< Global RSSI pointer */
static uint32_t *global_RxSync_ptr;       /**< Global Rx Sync pointer */

#ifdef WMBUS_DEBUG
static uint8_t wMBus_debug_log_index = 0;                        /**< Index of the debug log buffer */
static wMBus_Phy_debug_t wMBus_debug_log[WMBUS_LOG_BUFFER_SIZE]; /**< Debug log buffer */
#endif

wMBus_Phy_tRO_t wMBus_tRO = {0}; /**< tRO structure */
uint32_t wMBus_tTxD = 0;     /**< tTxD: FAC Transmission delay */

/**
  * @}
  */

/** @addtogroup Radio_Private_Functions
  * @{
  */
#ifdef STM32WL33XA
#ifdef ADJUST_FREQUENCY_169MHZ
__weak int adjustFrequencyBaseFor169(void);
__weak void revertFrequencyBaseFor169(void);
#endif
__weak void FEM_Operation(FEM_OperationType operation);
#endif
/**
  * @brief  Initializes the low-level hardware resources for the wM-Bus Phy radio.
  * @retval None
  */
static void wMBus_Phy_MRSubG_MspInit(void);
/**
  * @}
  */

/** @defgroup Radio_Exported_Functions Radio Exported Functions
  * @{
  */

wMBus_Phy_tRO_t wMBus_Phy_getTiming()
{
  return wMBus_tRO;
}

uint32_t wMBus_Phy_getTxD()
{
  return wMBus_tTxD;
}

void wMBus_Phy_init(uint8_t wMBus_mode, uint8_t wMBus_Direction, uint8_t wMBus_Format)
{
  /* Configures the radio parameters */
  wMBus_Phy_RadioInitStruct.lFrequencyBase = wMBus_Phy_Frequency[wMBus_mode][wMBus_Direction];
  wMBus_Phy_RadioInitStruct.xModulationSelect = wMBus_Phy_Modulation[wMBus_mode][wMBus_Direction];
  wMBus_Phy_RadioInitStruct.lDatarate = wMBus_Phy_Datarate[wMBus_mode][wMBus_Direction];
  wMBus_Phy_RadioInitStruct.lFreqDev = wMBus_Phy_FreqDev[wMBus_mode][wMBus_Direction];
  wMBus_Phy_RadioInitStruct.lBandwidth = wMBus_Phy_ChannelBandwidth[wMBus_mode][wMBus_Direction];
  wMBus_Phy_RadioInitStruct.dsssExp = 0;
  wMBus_Phy_RadioInitStruct.PADrvMode = PA_DRV_TX_HP;
  /* +10dBm Tx output power */
#ifdef STM32WL33XA
  wMBus_Phy_RadioInitStruct.outputPower = -8;
#else
  wMBus_Phy_RadioInitStruct.outputPower = 10;
#endif

  wMBus_Phy_MRSubG_MspInit();
  HAL_MRSubG_Init(&wMBus_Phy_RadioInitStruct);

  /* Configure Timing parameters */
  wMBus_tRO.tRO_min = wMBus_Phy_responseDelay[wMBus_mode][0];
  wMBus_tRO.tRO_max = wMBus_Phy_responseDelay[wMBus_mode][1];
  wMBus_tTxD = wMBus_Phy_FACTransmissionDelay[wMBus_mode];

  /* Configures the packet parameters */
  wMBus_Phy_PacketSettingsStruct.PreambleLength = wMBus_Phy_PreambleLength[wMBus_mode][wMBus_Direction];
  wMBus_Phy_PacketSettingsStruct.PostambleLength = PREAMBLE_BYTE(0);
  /* set Tx and Rx Sync settings - by default same but can be different in some special cases */
  wMBus_Phy_PacketSettingsStruct.SyncLength = wMBus_Phy_SyncLength[wMBus_mode][wMBus_Direction] - 1;
  wMBus_Phy_PacketSettingsStruct.SyncWord = wMBus_Phy_SyncPattern[wMBus_mode][wMBus_Direction];

  if (wMBus_mode == N_MODE_Ng)
  {
    /* specific configuration for Sync pattern : need to force 2-FSK SYnc pattern : set FORCE_2FSK_SYNC_MODE */
    LL_MRSubG_Force2FSKSync(ENABLE);
  }

  /* special Sync settings if needed */
  /* case C-mode & Format B */
  if ((wMBus_Format == WMBUS_FORMAT_B) && (wMBus_mode == C_MODE))
  {
    wMBus_Phy_PacketSettingsStruct.SyncWord = WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B;
  }

  wMBus_Phy_PacketSettingsStruct.FixVarLength = FIXED;
  wMBus_Phy_PacketSettingsStruct.PreambleSequence = PRE_SEQ_0101;
  wMBus_Phy_PacketSettingsStruct.PostambleSequence = POST_SEQ_0101;
  wMBus_Phy_PacketSettingsStruct.CrcMode = PKT_NO_CRC;
  wMBus_Phy_PacketSettingsStruct.Coding = (MRSubG_PcktCoding)wMBus_Phy_ChannelCoding[wMBus_mode][wMBus_Direction];
  /* set Manchester type1 if needed */
  if (wMBus_Phy_PacketSettingsStruct.Coding == CODING_MANCHESTER)
  {
    LL_MRSubG_PacketHandlerManchesterType(MANCHESTER_TYPE1);
  }
  wMBus_Phy_PacketSettingsStruct.DataWhitening = DISABLE;
  wMBus_Phy_PacketSettingsStruct.LengthWidth = BYTE_LEN_1;
  wMBus_Phy_PacketSettingsStruct.SyncPresent = ENABLE;

  /* in that case - ONLY FOR GATEWAY - special settings to be used */
#ifdef T1C1_ACTIVATED
  if ((wMBus_mode == C_MODE) || (wMBus_mode == T_MODE))
  {
    /* only Rx Sync settings to change */
    /* use different Sync pattern to cope with T1 AND C1 */
    wMBus_Phy_PacketSettingsStruct.SyncWord = WMBUS_SYNC_PATTERN_T1C1_MODE_M2O_GATEWAY;
    wMBus_Phy_PacketSettingsStruct.SyncLength = WMBUS_SYNC_LENGTH_T1C1_MODE_M2O_GATEWAY - 1;

    /* force NRZ decoding */
    wMBus_Phy_PacketSettingsStruct.Coding = CODING_NONE;
  }
#endif

  /* specific for 169MHz wM-Bus */
#ifdef STM32WL33XA
  /* if N2g mode, specific configuration for 4-GFSK05 */
  if (wMBus_mode == N_MODE_Ng)
  {
    /* specific configuration for preamble pattern : set LL_MRSubG_SetPreambleSeq : 4-GFSK 0111 pattern */
    LL_MRSubG_SetPreambleSeq(0);

    /* specific configuration for Sync pattern : need to force 2-FSK SYnc pattern : set FORCE_2FSK_SYNC_MODE */
    LL_MRSubG_Force2FSKSync(ENABLE);
  }
#endif

  HAL_MRSubG_PacketBasicInit(&wMBus_Phy_PacketSettingsStruct);

