betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/Phy/Src/stm32wl3_wMBus_Phy_radio.c
  /* set maximum packet length to avoid corrupting Radio buffer*/
  HAL_MRSubG_PktBasicSetPayloadLength(WMBUS_RADIO_BUFFER_SIZE);

  /* configure Output Power */
  HAL_MRSubG_SetPALeveldBm(7, wMBus_Phy_RadioInitStruct.outputPower, wMBus_Phy_RadioInitStruct.PADrvMode);

  /* check back */
  wMBus_Phy_RadioInitStruct.outputPower = HAL_MRSubG_GetPALeveldBm();

#ifdef WMBUS_RX_PERFORMANCE_ENABLED
  /* activate Rx performance settings - may depend on wM-Bus mode */
  wMBus_Phy_Rx_performance_settings(wMBus_mode, wMBus_Direction);
#endif

  HAL_NVIC_EnableIRQ(MRSUBG_IRQn);

  HAL_NVIC_ClearPendingIRQ(MRSUBG_IRQn);

  /* clear IRQ flags */
  __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(0xffffffff);

  /* Set the pointer to the data buffer */
  __HAL_MRSUBG_SET_DATABUFFER0_POINTER((uint32_t)&vectcRadioBuff);

  /* memorize frame format */
  wMBus_Format_global = wMBus_Format;
  /* memorize wM-Bus mode */
#if defined(T1C1_ACTIVATED) || defined(T1C1_ACTIVATED_C1_MODE) || defined(AUTOMATIC_FORMAT_DETECTION_C_MODE)
  wMBus_mode_global = wMBus_mode;
#endif
}

void wMBus_Phy_prepare_Tx_CRC_mngt(uint8_t *wMBus_TxBuffer, uint16_t wMBusTxBuffer_size, uint8_t FrameFormat)
{
  /* IRQ Config */
  __HAL_MRSUBG_SET_RFSEQ_IRQ_ENABLE(MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_TX_DONE_E | MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E);

  /* should align to Phy layer buffer which is 32-bit aligned : vectcRadioBuff */
  uint16_t i = 0;
  uint16_t radio_buffer_index = 0;
  uint8_t dataBytesRemaining;
  uint8_t blockDataSize;
  uint8_t *local_wMBus_Buffer_ptr = wMBus_TxBuffer;

  /* wMBusTxBuffer_size is buffer size without CRCs */
  dataBytesRemaining = wMBusTxBuffer_size;

  if (FrameFormat == WMBUS_FORMAT_A)
  {
    /* copy 1st block data into Radio buffer */
    for (i = 0; i < (WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - 2); i++)
    {
      vectcRadioBuff[i] = *(local_wMBus_Buffer_ptr);
      local_wMBus_Buffer_ptr++;
    }

    /* manage CRC of 1st block : After adding 2 byte CRC */
    wMBus_Phy_CRC_append(&vectcRadioBuff[0], &vectcRadioBuff[i]);
    /* update vectcRadioBuff index */
    i = i + 2;

    /* update remaining bytes */
    dataBytesRemaining = dataBytesRemaining - (WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - 2);

    /* Copy 0-16 bytes of data in the second block : determine nb of bytes to copy */
    if (dataBytesRemaining <= (WMBUS_BLOCK_SIZE_FORMAT_A - 2))
    {
      blockDataSize = dataBytesRemaining;
    }
    else
    {
      blockDataSize = (WMBUS_BLOCK_SIZE_FORMAT_A - 2);
    }

    /* copy 2nd block data into Radio buffer */
    for (i = WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i < (WMBUS_FIRST_BLOCK_SIZE_FORMAT_A + blockDataSize); i++)
    {
      vectcRadioBuff[i] = *(local_wMBus_Buffer_ptr);
      local_wMBus_Buffer_ptr++;
    }

    /* manage CRC of 2nd block : After adding 2 byte CRC */
    wMBus_Phy_CRC_append(&vectcRadioBuff[WMBUS_FIRST_BLOCK_SIZE_FORMAT_A], &vectcRadioBuff[i]);
    /* update vectcRadioBuff index */
    i = i + 2;

    /* update remaining bytes */
    dataBytesRemaining = dataBytesRemaining - blockDataSize;

    /* Assemble optional blocks */
    while (dataBytesRemaining)
    {
      /* ease index management */
      radio_buffer_index = i;

      /* Copy 0-16 bytes of data into the next block */
      if (dataBytesRemaining <= (WMBUS_BLOCK_SIZE_FORMAT_A - 2))
      {
        blockDataSize = dataBytesRemaining;
      }
      else
      {
        blockDataSize = (WMBUS_BLOCK_SIZE_FORMAT_A - 2);
      }

      /* Data-field (Data) - Application payload */
      /* copy nth block data into Radio buffer */
      for (i = radio_buffer_index; i < radio_buffer_index + blockDataSize; i++)
      {
        vectcRadioBuff[i] = *(local_wMBus_Buffer_ptr);
        local_wMBus_Buffer_ptr++;
      }

      /* manage CRC of 2nd block : After adding 2 byte CRC */
      wMBus_Phy_CRC_append(&vectcRadioBuff[radio_buffer_index], &vectcRadioBuff[i]);

      /* update vectcRadioBuff index */
      i = i + 2;

      dataBytesRemaining -= blockDataSize;
    }
  }
  else if (FrameFormat == WMBUS_FORMAT_B)
  {
    /* adapt L-field according to B format : without CRC for the time being...*/
    /* depends on the size of wM-Bus packet : either +2 CRC bytes or +4 */
    if (wMBusTxBuffer_size <= WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - 2)
    {
      vectcRadioBuff[0] = wMBusTxBuffer_size - 1 + 2;
    }
    else
    {
      vectcRadioBuff[0] = wMBusTxBuffer_size - 1 + 4;
    }

    /* skit first byte which is supposed to be L-field */
    local_wMBus_Buffer_ptr++;

    /* copy 1st block data into Radio buffer */
    for (i = 1; i < (WMBUS_FIRST_BLOCK_SIZE_FORMAT_B); i++)
    {
      vectcRadioBuff[i] = *(local_wMBus_Buffer_ptr);
      local_wMBus_Buffer_ptr++;
    }

    /* no CRC in 1st block - Format B */

    /* update remaining bytes */
    dataBytesRemaining = dataBytesRemaining - (WMBUS_FIRST_BLOCK_SIZE_FORMAT_B);

    /* Copy 0-116 bytes of data in the second block : determine nb of bytes to copy */
    if (dataBytesRemaining <= (WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - 2))
    {
      blockDataSize = dataBytesRemaining;
    }
    else
    {
      blockDataSize = (WMBUS_SECOND_BLOCK_SIZE_FORMAT_B - 2);
    }

    /* copy 2nd block data into Radio buffer */
    for (i = WMBUS_FIRST_BLOCK_SIZE_FORMAT_B; i < (WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + blockDataSize); i++)
    {
      vectcRadioBuff[i] = *(local_wMBus_Buffer_ptr);
      local_wMBus_Buffer_ptr++;
    }

    /* manage CRC of 2nd block : After adding 2 byte CRC */
    wMBus_Phy_CRC_append(&vectcRadioBuff[0], &vectcRadioBuff[i]);
    /* update vectcRadioBuff index */
    i = i + 2;

    /* update remaining bytes */
    dataBytesRemaining = dataBytesRemaining - blockDataSize;

    /* Assemble optional blocks */
    while (dataBytesRemaining)
    {
      /* ease index management */
      radio_buffer_index = i;

      /* Copy 0-126 bytes of data into the next block */
      if (dataBytesRemaining <= (WMBUS_OPTIONAL_BLOCK_SIZE_FORMAT_B - 2))
      {
        blockDataSize = dataBytesRemaining;
      }
      else
      {
        blockDataSize = (WMBUS_OPTIONAL_BLOCK_SIZE_FORMAT_B - 2);
      }

