betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/Phy/Src/stm32wl3_wMBus_Phy_radio.c
      /* Data-field (Data) - Application payload */
      /* copy nth block data into Radio buffer */
      for (i = radio_buffer_index; i < radio_buffer_index + blockDataSize; i++)
      {
        vectcRadioBuff[i] = *(local_wMBus_Buffer_ptr);
        local_wMBus_Buffer_ptr++;
      }

      /* manage CRC of 2nd block : After adding 2 byte CRC */
      wMBus_Phy_CRC_append(&vectcRadioBuff[radio_buffer_index], &vectcRadioBuff[i]);

      /* update vectcRadioBuff index */
      i = i + 2;

      dataBytesRemaining -= blockDataSize;
    }
  }
  /* specify Tx mode Normal */
  LL_MRSubG_SetTXMode(TX_NORMAL);

  /* ease index management */
  radio_buffer_index = i;

  /* do not forget to specify packet length as using packet handler */
  HAL_MRSubG_PktBasicSetPayloadLength(radio_buffer_index);
}

void wMBus_Phy_prepare_Rx(void)
{
  /* IRQ Config */
  uint32_t tmpReg = 0x00;
  tmpReg |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_OK_E | MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_ALMOST_FULL_0_E | MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E;

#ifdef PREAMBLE_AND_SYNC_IRQ_ENABLE
  tmpReg |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SYNC_VALID_E;

  /* by default set to 8 bits preamble verification */
  __HAL_MRSUBG_SET_PQI_THRESHOLD(0x02);

  tmpReg |= MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_PREAMBLE_VALID_E;
#endif
  __HAL_MRSUBG_SET_RFSEQ_IRQ_ENABLE(tmpReg);

  /* specify Rx mode Normal */
  LL_MRSubG_SetRXMode(RX_NORMAL);

  /* do not forget to specify maximum Rx packet length as using packet handler */
  HAL_MRSubG_PktBasicSetPayloadLength(WMBUS_RADIO_BUFFER_SIZE);

#ifndef WMBUS_FIRST_CRC_CHECK
  /* initialize Rx buffer threshold to xx bytes - size of max of 1st block size :format A */
  LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_BLOCK_SIZE_FORMAT_A);
#else
  /* initialize Rx buffer threshold to xx bytes - size of max number of bytes to include CRC - format A */
  LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
#endif

#if defined(T1C1_ACTIVATED_C1_MODE)
  if (wMBus_mode_global == C_MODE)
  {
    /* only Rx Sync settings to change */
    /* use different Sync pattern to cope with T1 AND C1 */
    LL_MRSubG_SetSyncWord(WMBUS_SYNC_PATTERN_T1C1_MODE_M2O_GATEWAY);
    LL_MRSubG_SetSyncLength(WMBUS_SYNC_LENGTH_T1C1_MODE_M2O_GATEWAY - 1);

    /* force NRZ decoding */
    LL_MRSubG_PacketHandlerCoding(CODING_NONE);
  }
#endif
#if defined(T1C1_ACTIVATED)
  if ((wMBus_mode_global == C_MODE) || (wMBus_mode_global == T_MODE))
  {
    /* only Rx Sync settings to change */
    /* use different Sync pattern to cope with T1 AND C1 */
    LL_MRSubG_SetSyncWord(WMBUS_SYNC_PATTERN_T1C1_MODE_M2O_GATEWAY);
    LL_MRSubG_SetSyncLength(WMBUS_SYNC_LENGTH_T1C1_MODE_M2O_GATEWAY - 1);

    /* force NRZ decoding */
    LL_MRSubG_PacketHandlerCoding(CODING_NONE);
  }
#endif

#ifdef AUTOMATIC_FORMAT_DETECTION_C_MODE
  /* check if C-mode Rx is activated and enable dynamic frame format reception */
  if (wMBus_mode_global == C_MODE)
  {
    switch (wMBus_Format_global)
    {
    /* frame format is undefined */
    case WMBUS_FORMAT_A_B:

      /* check if T1C1_ACTIVATED_C1_MODE is activated */
#ifdef T1C1_ACTIVATED_C1_MODE

      /* in that case activate different C-mode Sync pattern & length */
      LL_MRSubG_SetSyncWord(WMBUS_SYNC_PATTERN_T1C1_MODE_M2O_GATEWAY);
      LL_MRSubG_SetSyncLength(WMBUS_SYNC_LENGTH_T1C1_MODE_M2O_GATEWAY - 1);

#else

      /* in that case activate different C-mode Sync pattern & length */
      LL_MRSubG_SetSyncWord(WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_UNDEFINED);
      LL_MRSubG_SetSyncLength(WMBUS_SYNC_LENGTH_C_MODE_M2O_FORMAT_UNDEFINED - 1);
#endif

      break;

    case WMBUS_FORMAT_A:
    case WMBUS_FORMAT_B:

      /* nothing to do - already done */
      break;

    default:

      break;
    }
  }

#endif

  /* initialize Rx state machine */
  xRxState = SM_RX_NEW_PACKET;

  /* force automatic Rx */
  wMBus_Auto_Rx = 1;
}

uint8_t wMBus_Phy_start_transmission(void)
{
  __HAL_MRSUBG_STROBE_CMD(CMD_TX);
#ifdef WMBUS_DEBUG
  wMBus_Phy_trace_debug_log(DEBUG_COMMAND_TX_LOG, 0, 0, 0);
#endif

  return SUCCESS;
}

uint8_t wMBus_Phy_start_continuousRx(void)
{
  /* force automatic Rx */
  wMBus_Auto_Rx = 1;

#ifdef STM32WL33XA
#ifdef ADJUST_FREQUENCY_169MHZ
  /* Call this API before RX */
  adjustFrequencyBaseFor169();
#endif
  /* Restart RX */
  FEM_Operation(FEM_RX);
#endif

  __HAL_MRSUBG_STROBE_CMD(CMD_RX);
#ifdef WMBUS_DEBUG
  wMBus_Phy_trace_debug_log(DEBUG_COMMAND_RX_CONTINUOUS_LOG, 0, 0, 0);
#endif

  return SUCCESS;
}

uint8_t wMBus_Phy_start_RxTimer(uint32_t RxTimeoutMicrosec, uint8_t RxTimeoutStopCondition)
{
  uint32_t RxTimerReg = 0;

  /* force automatic Rx */
  wMBus_Auto_Rx = 0;

  /* compute Rx timer value */
  RxTimerReg = HAL_MRSubG_Sequencer_Microseconds(RxTimeoutMicrosec);

  /* write Rx timer Register */
  __HAL_MRSUBG_SET_RX_TIMEOUT(RxTimerReg);

  /* set Stop timeout conditions */
  if ((RxTimeoutStopCondition & RX_CS_TIMEOUT_MASK) == RX_CS_TIMEOUT_MASK)
  {
    LL_MRSubG_SetRxCsTimeout(ENABLE);
  }
  else
  {
    LL_MRSubG_SetRxCsTimeout(DISABLE);
  }

  if ((RxTimeoutStopCondition & RX_PQI_TIMEOUT_MASK) == RX_PQI_TIMEOUT_MASK)
  {
    LL_MRSubG_SetRxPqiTimeout(ENABLE);
  }
  else
  {
    LL_MRSubG_SetRxPqiTimeout(DISABLE);
  }

  if ((RxTimeoutStopCondition & RX_SQI_TIMEOUT_MASK) == RX_SQI_TIMEOUT_MASK)
  {
    LL_MRSubG_SetRxSqiTimeout(ENABLE);
  }
  else
  {
    LL_MRSubG_SetRxSqiTimeout(DISABLE);
  }

  if ((RxTimeoutStopCondition & RX_OR_nAND_SELECT) == RX_OR_nAND_SELECT)
  {
    LL_MRSubG_SetRxOrnAndSelect(SET);
  }
  else
  {
    LL_MRSubG_SetRxOrnAndSelect(RESET);
  }

#ifdef STM32WL33XA
#ifdef ADJUST_FREQUENCY_169MHZ
  /* Call this API before RX */
  adjustFrequencyBaseFor169();
#endif
  /* Restart RX */
  FEM_Operation(FEM_RX);
#endif

  __HAL_MRSUBG_STROBE_CMD(CMD_RX);
#ifdef WMBUS_DEBUG
  wMBus_Phy_trace_debug_log(DEBUG_COMMAND_RX_TIMER_LOG, 0, 0, 0);
#endif

  return SUCCESS;
}

void wMBus_Phy_abort(void)
{
  /* disable automatic Rx */
  wMBus_Auto_Rx = 0;

  /* send sabort command to Radio IP */
  __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
  wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

  /* here need a smarter management :
     - either wait for Sabort Flag - if compilation switch activated
     - or check Radio FSM (already) in Idle mode
  */

  /* wait for SABORT IRQ confirmation or Radio FSM state Idle */
  while ((!xSabortCompletedFlag) && (LL_MRSubG_GetRadioFSMState() != STATE_IDLE));

