betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/Phy/Src/stm32wl3_wMBus_Phy_radio.c
  xSabortCompletedFlag = RESET;
}

#if defined(T1C1_ACTIVATED) || defined(T1C1_ACTIVATED_C1_MODE)
/**
  * @brief  Decode T1+C1 mode by Sw - gateway only case.
  * @note   This function is defined when T1C1_ACTIVATED or T1C1_ACTIVATED_C1_MODE is defined.
  * @param  tos_in Pointer to the input buffer.
  * @param  tos_out Pointer to the output buffer.
  * @retval uint8_t size of the output buffer.
  */
static uint8_t ToS_decode(uint8_t *tos_in, uint8_t *tos_out)
{
  uint8_t nibble;
  uint16_t semioct;
  uint8_t size = 0;

  tos_out[0] = 0;
  tos_out[1] = 0;

  for (uint8_t j = 0; j < 4; j++)
  {
    switch (j)
    {
    case 0:
      nibble = tos_in[0] >> 2;
      break;
    case 1:
      nibble = ((tos_in[0] & 0x03) << 4) + (tos_in[1] >> 4);
      break;
    case 2:
      nibble = ((tos_in[1] & 0x0F) << 2) + (tos_in[2] >> 6);
      break;
    case 3:
      nibble = tos_in[2] & 0x3F;
      break;
    }

    switch (nibble)
    {
    case 22:
      semioct = 0;
      break;
    case 13:
      semioct = 1;
      break;
    case 14:
      semioct = 2;
      break;
    case 11:
      semioct = 3;
      break;
    case 28:
      semioct = 4;
      break;
    case 25:
      semioct = 5;
      break;
    case 26:
      semioct = 6;
      break;
    case 19:
      semioct = 7;
      break;
    case 44:
      semioct = 8;
      break;
    case 37:
      semioct = 9;
      break;
    case 38:
      semioct = 10;
      break;
    case 35:
      semioct = 11;
      break;
    case 52:
      semioct = 12;
      break;
    case 49:
      semioct = 13;
      break;
    case 50:
      semioct = 14;
      break;
    case 41:
      semioct = 15;
      break;
    default:
      return size;
    }

    tos_out[j >> 1] |= (semioct << (4 * ((j % 2) == 0)));

    if (j == 1 || j == 3) size++;
  }

  return size;
}

/* Static variables to be used in wM-Bus Rx IRQ handler to decode T-mode by Sw using T1C1_ACTIVATED */
static uint16_t tos_q_head = 0, tos_q_tail = 0, tos_q_done_head = 0;
uint8_t tos_out[2], tos_in[3];
#endif

void wMBus_Phy_IRQHandler(void)
{
  uint32_t irq;

  irq = __HAL_MRSUBG_GET_RFSEQ_IRQ_STATUS();

  if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_DONE_F)
  {
    /* Clear the IRQ flag */
    __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_TX_DONE_F);

#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_IRQ_TX_DONE_LOG, 0, 0, 0);
#endif

    wMBus_Radio_Event_bitmap |= WMBUS_TX_COMPLETED;
  }

  /* check SABORT DONE IRQ */
  if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SABORT_DONE_F)
  {
    /* Clear the IRQ flag */
    __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SABORT_DONE_F);

#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_IRQ_ABORT_LOG, wMBus_Auto_Rx, 0, 0);
#endif

    if (wMBus_Auto_Rx == 1)
    {
#ifdef STM32WL33XA
#ifdef ADJUST_FREQUENCY_169MHZ
      /* Call this API after RX */
      revertFrequencyBaseFor169();
#endif
#endif

      /* initialize Rx state machine */
      xRxState = SM_RX_NEW_PACKET;

#ifndef WMBUS_FIRST_CRC_CHECK
      /* initialize Rx buffer threshold to xx bytes - size of max of 1st block size :format A */
      LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_BLOCK_SIZE_FORMAT_A);
#else
      /* initialize Rx buffer threshold to xx bytes - size of max number of bytes to include CRC - format A */
      LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
#endif

#ifdef STM32WL33XA
#ifdef ADJUST_FREQUENCY_169MHZ
      /* Call this API before RX */
      adjustFrequencyBaseFor169();
#endif
      /* Restart RX */
      FEM_Operation(FEM_RX);
#endif

      /* if sabort done then issue Rx command */
      __HAL_MRSUBG_STROBE_CMD(CMD_RX);
#ifdef WMBUS_DEBUG
      wMBus_Phy_trace_debug_log(DEBUG_COMMAND_RX_CONTINUOUS_LOG, 0, 0, 0);
#endif
    }
    else
    {
      /* indicate flag status */
      xSabortCompletedFlag = SET;
    }
  }

  if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_TIMEOUT_F)
  {
    __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_TIMEOUT_F);

#ifdef STM32WL33XA
#ifdef ADJUST_FREQUENCY_169MHZ
    /* Call this API after RX */
    revertFrequencyBaseFor169();
#endif
#endif

#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_IRQ_RX_TIMER_LOG, 0, 0, 0);
#endif

    wMBus_Radio_Event_bitmap |= WMBUS_RX_TIMEOUT;
  }

  if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F)
  {
#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_IRQ_RX_FIFO_LOG, 0, 0, 0);
#endif
    /* flag to set Sabort command to issue as multiple Sabort cases to handle */

    if (xRxState == SM_RX_NEW_PACKET)
    {
      RssiOnSync = LL_MRSubG_GetRssiLevelOnSync();
      /* save Sync pattern - upper layer purpose */
      RxSync_Ongoing = LL_MRSubG_GetSyncWord();

#if !defined(T1C1_ACTIVATED) && !defined(T1C1_ACTIVATED_C1_MODE)
#ifndef AUTOMATIC_FORMAT_DETECTION_C_MODE
      /* extract L-field */
      cLField = vectcRadioBuff[0];

      if (wMBus_Format_global == WMBUS_FORMAT_A)
      {
        nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
        *(global_buffer_format_ptr) = WMBUS_FORMAT_A;
      }
      if (wMBus_Format_global == WMBUS_FORMAT_B)
      {
        nPcktLength = 1 + cLField;
        *(global_buffer_format_ptr) = WMBUS_FORMAT_B;
      }
#else // #ifndef AUTOMATIC_FORMAT_DETECTION_C_MODE
      /* manage dynamic C-mode detection */
      /* to be checked which C-mode frame format it is */
      /* only if C-mode is activated and frame format WMBUS_FORMAT_A_B (undefined) */
      if ((wMBus_mode_global == C_MODE) && (wMBus_Format_global == WMBUS_FORMAT_A_B))
      {
        if (vectcRadioBuff[0] == (WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A & 0x000000FF))
        {
          RxSync_Ongoing = WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A;
          *(global_buffer_format_ptr) = WMBUS_FORMAT_A;
        }
        else if (vectcRadioBuff[0] == (WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B & 0x000000FF))
        {
          RxSync_Ongoing = WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B;
          *(global_buffer_format_ptr) = WMBUS_FORMAT_B;
        }
        else
        {
          /* here there is an error and we should stop reception */
          /* Clear the IRQ flag */
          __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F);

#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_VALID_HEADER_ERROR_C_MODE, vectcRadioBuff[0], 0, 0);
#endif

          __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

          wMBus_Radio_Event_bitmap |= WMBUS_RX_VALID_HEADER_ERROR;

          return;
        }

        /* here L-field is 2nd byte of Radio buffer - shifted by 1 */
        cLField = vectcRadioBuff[1];
        if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A)
        {
          nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
        }
        if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B)
        {
          nPcktLength = 1 + cLField;
        }
      }
      else if ((wMBus_mode_global != C_MODE) || ((wMBus_mode_global == C_MODE) && (wMBus_Format_global != WMBUS_FORMAT_A_B)))
      /* here this normal case to handle : other than C-mode */
      {
        /* extract L-field */
        cLField = vectcRadioBuff[0];
        if (wMBus_Format_global == WMBUS_FORMAT_A)
        {
          nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
          *(global_buffer_format_ptr) = WMBUS_FORMAT_A;
        }
        if (wMBus_Format_global == WMBUS_FORMAT_B)
        {
          nPcktLength = 1 + cLField;
          *(global_buffer_format_ptr) = WMBUS_FORMAT_B;
        }
      }
#endif
      /* L should be at least 10 or 11 depending frame format, otherwise abort */
      if (((cLField < 10) && (wMBus_Format_global == WMBUS_FORMAT_A)) || ((cLField < 11) && (wMBus_Format_global == WMBUS_FORMAT_B)))
      {
        /* Clear the IRQ flag before return*/
        __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F);

#ifdef WMBUS_DEBUG
        wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_VALID_HEADER_ERROR_L_FIELD, cLField, wMBus_Format_global, 0);
#endif

        __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
        wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

        wMBus_Radio_Event_bitmap |= WMBUS_RX_VALID_HEADER_ERROR;
        return;
      }
      else
      {
#ifdef WMBUS_FIRST_CRC_CHECK
        if (!wMBus_Phy_first_CRC_check())
        {
          /* if 1st CRC check is failed then stop Rx ASAP */
          /* Clear the IRQ flag before return*/
          __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F);
#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_FIRST_CRC_ERROR, cLField, wMBus_Format_global, 0);
#endif
          __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

          wMBus_Radio_Event_bitmap |= WMBUS_FIRST_CRC_ERROR;
          return;
        }
        else
        {
#endif
#ifndef AUTOMATIC_FORMAT_DETECTION_C_MODE
          /* update 2nd Rx buffer threshold */
#ifdef WMBUS_FIRST_CRC_CHECK
          if (nPcktLength < WMBUS_FIRST_RXBUFFER_THRESHOLD)
          {
            LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
          }
          else
          {
            LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
          }
#else
          LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
#endif
#else
        /* AUTOMATIC_FORMAT_DETECTION_C_MODE activated but check if C-mode & WMBUS_FORMAT_A_B */
        if ((wMBus_mode_global == C_MODE) && (wMBus_Format_global == WMBUS_FORMAT_A_B))
        {
#ifdef WMBUS_FIRST_CRC_CHECK
          if (nPcktLength + 1 < WMBUS_FIRST_RXBUFFER_THRESHOLD)
          {
            LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
          }
          else
          {
            LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength + 1);
          }
#else
          LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength + 1);
#endif
        }
        else
        {
#ifdef WMBUS_FIRST_CRC_CHECK
          if (nPcktLength < WMBUS_FIRST_RXBUFFER_THRESHOLD)
          {
            LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
          }
          else
          {
            LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
          }
#else
          LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
#endif
        }
#endif
          xRxState = SM_RX_LAST;

#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_END_RX_SM_FISRT_PROCESSING, (uint32_t)nPcktLength, (uint32_t)RxSync_Ongoing, (uint32_t)RssiOnSync);
#endif
#ifdef WMBUS_FIRST_CRC_CHECK
        }
#endif
      }
#else /* T1C1 ACTIVATED or T1C1 ACTIVATED_C1_MODE*/
      /* to be checked whether C-Sync 3rd byte (0x54) or 3o6 T-mode byte */

      /* check T or C mode requested by application (as other modes can be also used with that Sw configuration) */
      if ((wMBus_mode_global == C_MODE) || (wMBus_mode_global == T_MODE))
      {
        if (vectcRadioBuff[0] == ((WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A >> 8) & 0x000000FF))
        {
          /* to be checked which C-mode frame format it is */
          if (vectcRadioBuff[1] == (WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A & 0x000000FF))
          {
            RxSync_Ongoing = WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A;
            *(global_buffer_format_ptr) = WMBUS_FORMAT_A;
          }
          else if (vectcRadioBuff[1] == (WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B & 0x000000FF))
          {
            RxSync_Ongoing = WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B;
            *(global_buffer_format_ptr) = WMBUS_FORMAT_B;
          }
          else
          {
            /* here there is an error and we should stop reception */
            /* Clear the IRQ flag */
            __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F);

#ifdef WMBUS_DEBUG
            wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_VALID_HEADER_ERROR_C_MODE, ((vectcRadioBuff[0] << 8) | vectcRadioBuff[1]), 0, 0);
#endif

            __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
            wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

            wMBus_Radio_Event_bitmap |= WMBUS_RX_VALID_HEADER_ERROR;
            return;
          }
        }
        else
        /* here it is supposed to be T-mode */
        {
          /* saved Sync word (T-mode) */
          RxSync_Ongoing = WMBUS_SYNC_PATTERN_T_MODE_M2O;
          *(global_buffer_format_ptr) = wMBus_Format_global;
        }

