betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/Phy/Src/stm32wl3_wMBus_Phy_radio.c
        /* now we have to check L-field consistency */

        /* decode L-field using 3o6 Sw decoding */
        if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O)
        {
          uint8_t tos_in[3], tos_out[2];

          for (uint8_t j = 0; j < 3; j++)
          {
            tos_in[j] = vectcRadioBuff[j];
          }

          ToS_decode(tos_in, tos_out);
          cLField = tos_out[0];
        }
        else
        {
          /* in that case C-mode and NRZ encoded - L-field is in 3rd byte - 2 1st bytes are Sync pattern */
          cLField = vectcRadioBuff[2];
        }

        /* L should be at least 10 (C-field+M-field+A-field+CI-field),
        if not Sabort Rx */
        if (cLField < 10)
        {
          /* Clear the IRQ flag */
          __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F);
#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_VALID_HEADER_ERROR_L_FIELD, cLField, RxSync_Ongoing, 0);
#endif
          __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

          wMBus_Radio_Event_bitmap |= WMBUS_RX_VALID_HEADER_ERROR;
          return;
        }

        /* now need to compute length of wM-Bus packet / buffer */
        /* as T1C1_ACTIVATED enabled we don't know frame format in case C-mode => we have to check it based on RxSync_Ongoing info */
        if ((RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O) && (wMBus_Format_global == WMBUS_FORMAT_A))
        {
          nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
        }
        else if ((RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O) && (wMBus_Format_global == WMBUS_FORMAT_B))
        {
          nPcktLength = 1 + cLField;
        }
        else if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A)
        {
          nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
        }
        else if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B)
        {
          nPcktLength = 1 + cLField;
        }

        /* here we have to take care 3o6 case where radio buffer is 50% longer */
        if ((RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O))
        {
          nPcktLengthRaw = nPcktLength * 3;

          if (nPcktLengthRaw % 2 == 0)
            nPcktLengthRaw /= 2;
          else
            nPcktLengthRaw = (nPcktLengthRaw + 1) / 2;

#ifdef WMBUS_FIRST_CRC_CHECK
          if (nPcktLengthRaw < WMBUS_FIRST_RXBUFFER_THRESHOLD)
          {
            LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
          }
          else
          {
            LL_MRSubG_SetAlmostFullThresholdRx(nPcktLengthRaw);
          }
#else
          LL_MRSubG_SetAlmostFullThresholdRx(nPcktLengthRaw);
#endif
        }
        else /* default case for nPcktLength buffer IRQ */
        {
          /* update 2nd Rx buffer threshold with +2 as 2 1st bytes are C-mode Sync */
#ifdef WMBUS_FIRST_CRC_CHECK
          if (nPcktLength + 2 < WMBUS_FIRST_RXBUFFER_THRESHOLD)
          {
            LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
          }
          else
          {
            LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength + 2);
          }
#else
          LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength + 2);
#endif
        }
#ifdef WMBUS_FIRST_CRC_CHECK
        if (!wMBus_Phy_first_CRC_check())
        {
          /* if 1st CRC check is failed then stop Rx ASAP */

          /* Clear the IRQ flag before return*/
          __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F);

#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_FIRST_CRC_ERROR, cLField, wMBus_Format_global, 0);
#endif

          __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

          wMBus_Radio_Event_bitmap |= WMBUS_FIRST_CRC_ERROR;
          return;
        }
        else
        {
#endif

          /* update 2nd Rx buffer threshold */
          xRxState = SM_RX_LAST;
#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_END_RX_SM_FISRT_PROCESSING, nPcktLength, RxSync_Ongoing, RssiOnSync);
#endif
#ifdef WMBUS_FIRST_CRC_CHECK
        }
#endif

      } /*end if ((wMBus_mode_global == C_MODE) || (wMBus_mode_global == T_MODE)) */
      /* this case can happen */
      else if ((wMBus_mode_global == S1M_MODE) || (wMBus_mode_global == S_MODE))
      {
        /* extract L-field */
        cLField = vectcRadioBuff[0];

        if (wMBus_Format_global == WMBUS_FORMAT_A)
        {
          nPcktLength = 1 + cLField + 2 + 2 * (CEILING(((float)cLField - 9) / 16));
          *(global_buffer_format_ptr) = WMBUS_FORMAT_A;
        }
        if (wMBus_Format_global == WMBUS_FORMAT_B)
        {
          nPcktLength = 1 + cLField;
          *(global_buffer_format_ptr) = WMBUS_FORMAT_B;
        }

        /* L should be at least 10 or 11 depending frame format, otherwise abort */
        if (((cLField < 10) && (wMBus_Format_global == WMBUS_FORMAT_A)) || ((cLField < 11) && (wMBus_Format_global == WMBUS_FORMAT_B)))
        {
          /* Clear the IRQ flag before return*/
          __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F);

#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_VALID_HEADER_ERROR_L_FIELD, cLField, wMBus_Format_global, 0);
#endif

          __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
          wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

          wMBus_Radio_Event_bitmap |= WMBUS_RX_VALID_HEADER_ERROR;
          return;
        }
        else
        {

#ifdef WMBUS_FIRST_CRC_CHECK
          if (!wMBus_Phy_first_CRC_check())
          {
            /* if 1st CRC check is failed then stop Rx ASAP */

            /* Clear the IRQ flag before return*/
            __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F);

#ifdef WMBUS_DEBUG
            wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_FIRST_CRC_ERROR, cLField, wMBus_Format_global, 0);
#endif

            __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
            wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

            wMBus_Radio_Event_bitmap |= WMBUS_FIRST_CRC_ERROR;
            return;
          }
          else
          {
#endif

            /* update 2nd Rx buffer threshold */
#ifdef WMBUS_FIRST_CRC_CHECK
            if (nPcktLength < WMBUS_FIRST_RXBUFFER_THRESHOLD)
            {
              LL_MRSubG_SetAlmostFullThresholdRx(WMBUS_FIRST_RXBUFFER_THRESHOLD);
            }
            else
            {
              LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
            }
#else
          LL_MRSubG_SetAlmostFullThresholdRx(nPcktLength);
#endif

            xRxState = SM_RX_LAST;

#ifdef WMBUS_DEBUG
            wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_END_RX_SM_FISRT_PROCESSING, (uint32_t)nPcktLength, (uint32_t)RxSync_Ongoing, (uint32_t)RssiOnSync);
#endif
#ifdef WMBUS_FIRST_CRC_CHECK
          }
#endif
        }
      }
#endif
    }
    else if (xRxState == SM_RX_LAST)
    {
      /* stop Rx - all packet bytes have been received */
      xRxDoneFlag = SET;

#if defined(T1C1_ACTIVATED) || defined(T1C1_ACTIVATED_C1_MODE)
      /* here need to re-format RxBuffer to be compliant with
      wMBus_Phy_wait_Rx_CRC_mngt()
      => using same Radio buffer*/

