betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/Phy/Src/stm32wl3_wMBus_Phy_radio.c
      if ((wMBus_mode_global == C_MODE) || (wMBus_mode_global == T_MODE))
      {
        uint16_t i = 0;

        /* T1C1 C-mode case : copy by shifting bytes by -2 */
        if ((RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A) || (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B))
        {
          /* nPcktLength NRZ bytes to copy */
          for (i = 0; i < nPcktLength; i++)
          {
            vectcRadioBuff_copy[i] = vectcRadioBuff[i + 2];
          }
        }

        /* T1C1 T-mode case : 3o6 decoding + copy (into same buffer) */
        else if ((RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O))
        {
          /* 3o6 decoding until nPcktLengthRaw */
          uint16_t tos_q_tgt = nPcktLengthRaw;

          tos_q_head = 0; // 1st 3o6 RAW byte to decode
          tos_q_tail = 0; // 1st decoded byte to write

          /* indexes of RAW 3o6 buffer */
          tos_q_done_head = 0;

          while (tos_q_done_head < tos_q_tgt)
          {
            ToS_decode(&vectcRadioBuff[tos_q_head], tos_out);

            tos_q_head = tos_q_head + 3;
            tos_q_done_head += 3;

            for (uint8_t j = 0; j < 2; j++)
            {
              vectcRadioBuff_copy[tos_q_tail] = tos_out[j];
              tos_q_tail++;
            }
          }
        }
        else /* default case : simply copy Radio buffer as is */
        {
          /* nPcktLength NRZ bytes to copy */
          for (i = 0; i < nPcktLength; i++)
          {
            vectcRadioBuff_copy[i] = vectcRadioBuff[i];
          }
        }

      } /* end if ((wMBus_mode_global == C_MODE) || (wMBus_mode_global == T_MODE)) */
      else if ((wMBus_mode_global == S1M_MODE) || (wMBus_mode_global == S_MODE))
      {
        uint16_t i = 0;

        /* nPcktLength NRZ bytes to copy */
        for (i = 0; i < nPcktLength; i++)
        {
          vectcRadioBuff_copy[i] = vectcRadioBuff[i];
        }
      }
#else /* T1C1_ACTIVATED */

      uint16_t i = 0;

#ifndef AUTOMATIC_FORMAT_DETECTION_C_MODE
      /* nPcktLength NRZ bytes to copy */
      for (i = 0; i < nPcktLength; i++)
      {
        vectcRadioBuff_copy[i] = vectcRadioBuff[i];
      }
#else
      /* nPcktLength NRZ bytes to copy */
      /* we have to verify which mode as automatic detection applies only to C-mode */
      if ((wMBus_mode_global == C_MODE) && (wMBus_Format_global == WMBUS_FORMAT_A_B))
      {
        for (i = 0; i < nPcktLength; i++)
        {
          vectcRadioBuff_copy[i] = vectcRadioBuff[i + 1];
        }
      }
      else
      {
        for (i = 0; i < nPcktLength; i++)
        {
          vectcRadioBuff_copy[i] = vectcRadioBuff[i];
        }
      }

#endif

#endif

#ifdef WMBUS_DEBUG
      wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_END_RX_SM_LAST_PROCESSING, nPcktLength, RxSync_Ongoing, RssiOnSync);
#endif

      wMBus_Radio_Event_bitmap |= WMBUS_RX_COMPLETED_WITH_RAW_BUFFER;

      *(global_buffer_size_ptr) = wMBus_Phy_wait_Rx_CRC_mngt(global_buffer_ptr, global_RssiDbm_ptr, *(global_buffer_format_ptr), global_RxSync_ptr);
    }

    /* Clear the IRQ flag */
    __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_ALMOST_FULL_0_F);
  }

  /* check this case even if it shouldn't happen */
  if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_OK_F)
  {
    __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_RX_OK_F);

#ifdef STM32WL33XA
#ifdef ADJUST_FREQUENCY_169MHZ
    /* Call this API after RX */
    revertFrequencyBaseFor169();
#endif
#endif

#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_IRQ_RX_DONE_LOG, 0, 0, 0);
#endif

    wMBus_Radio_Event_bitmap |= WMBUS_RX_OVERFLOW_ERROR;

#ifdef STM32WL33XA
#ifdef ADJUST_FREQUENCY_169MHZ
    /* Call this API before RX */
    adjustFrequencyBaseFor169();
#endif
    /* Restart RX */
    FEM_Operation(FEM_RX);
#endif

    /* re-start Rx */
    __HAL_MRSUBG_STROBE_CMD(CMD_RX);
#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_COMMAND_RX_CONTINUOUS_LOG, 0, 0, 0);
#endif
  }

#ifdef PREAMBLE_AND_SYNC_IRQ_ENABLE
  /* check this case even if it shouldn't happen */
  if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SYNC_VALID_F)
  {
    __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SYNC_VALID_F);

    wMBus_Radio_Event_bitmap |= WMBUS_RX_VALID_SYNC_DETECTED;
  }

  /* check this case even if it shouldn't happen */
  if (irq & MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_PREAMBLE_VALID_F)
  {
    __HAL_MRSUBG_CLEAR_RFSEQ_IRQ_FLAG(MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_PREAMBLE_VALID_F);

    wMBus_Radio_Event_bitmap |= WMBUS_RX_VALID_PREAMBLE_DETECTED;
  }
#endif
}

uint16_t wMBus_Phy_wait_Rx_CRC_mngt(uint8_t *RxBuffer, int32_t *RssiDbm, uint8_t FrameFormat, uint32_t *RxSync)
{
  /* CRC result */
  uint8_t xCrcResult = FALSE;

  /* remaining bytes to analyze */
  uint16_t dataBytesRemaining = 0;

  /* packet length without CRC */
  uint16_t nPcktLength_no_CRC = 0;

  /* store start of buffer */
  uint8_t *pStartBuffer = RxBuffer;

  while (!xRxDoneFlag);

  xRxDoneFlag = RESET;

  /* now copy Radio buffer into LL buffer to release Radio buffer */
  uint16_t i = 0;
  uint8_t j;
  uint8_t n_block = 1;

  /* nPcktLength computed during packet reception SM */
  if (global_buffer_allocation < nPcktLength)
  {
    /* in that case LL buffer is too small */
    /* just set nPcktLength = 0xFFFF and don't copy data to avoid memory corruption */
    nPcktLength = 0xFFFF;
    wMBus_Radio_Event_bitmap |= WMBUS_RX_BUFFER_SIZE_ERROR;
  }
  else
  {
    if (nPcktLength > WMBUS_RADIO_BUFFER_SIZE_MAX_3O6)
    {
      nPcktLength = 0xFFFF;
      wMBus_Radio_Event_bitmap |= WMBUS_RX_OVERFLOW_ERROR;
    }
    else
    {
      for (i = 0; i < nPcktLength; i++)
      {
        *(RxBuffer) = vectcRadioBuff_copy[i];
        RxBuffer++;
      }
    }
  }

  /* save RssiOnSync level and stop (and Start Rx) */
  RssiRxDone = RssiOnSync;

  /* save Sync Word used for Rx */
  RxSync_RxDone = RxSync_Ongoing;

  /* now send Sabort command and reset variables */
  __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
  wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

  *RssiDbm = __HAL_MRSUBG_CONVERT_RSSI_TO_DBM(RssiRxDone);
  *RxSync = RxSync_RxDone;

  /* check CRCs only if nPcktLength is consistent */
  if (nPcktLength != 0xFFFF)
  {
    /* as this point we can analyze wM-Bus CRCs - depends on Frame Format info
       or if dynamic frame format detection rely on RxSync_RxDone */
    /* different cases to consider */
    if (FrameFormat == WMBUS_FORMAT_A)
    {
      /* CRC verification */
      xCrcResult = TRUE;

      /* check 1st block CRC */
      xCrcResult = wMBus_Phy_CRC_check(pStartBuffer, pStartBuffer + WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - 2);

      /* update pStartBuffer ptr */
      pStartBuffer = pStartBuffer + WMBUS_FIRST_BLOCK_SIZE_FORMAT_A;

      /* update buffer size without CRC */
      nPcktLength_no_CRC = WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - 2;

      /* update remaining bytes to analyze */
      dataBytesRemaining = nPcktLength - WMBUS_FIRST_BLOCK_SIZE_FORMAT_A;

      /* check CRCs of each block fully filled (WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes) */
      for (uint16_t i = 0; i < (nPcktLength - WMBUS_FIRST_BLOCK_SIZE_FORMAT_A) / WMBUS_BLOCK_SIZE_FORMAT_A; i++)
      {
        xCrcResult &= wMBus_Phy_CRC_check(pStartBuffer, pStartBuffer + WMBUS_BLOCK_SIZE_FORMAT_A - 2);

        /* copy/shift by 2 bytes in buffer without CRCs - to LL*/
        for (j = 0; j < WMBUS_BLOCK_SIZE_FORMAT_A - 2; j++)
        {
          *(pStartBuffer - (2 * n_block) + j) = *(pStartBuffer + j);
        }

        /* update pointer */
        pStartBuffer = pStartBuffer + WMBUS_BLOCK_SIZE_FORMAT_A;
        n_block += 1;

        nPcktLength_no_CRC = nPcktLength_no_CRC + WMBUS_BLOCK_SIZE_FORMAT_A - 2;

        /* update remaining bytes to analyze */
        dataBytesRemaining = dataBytesRemaining - WMBUS_BLOCK_SIZE_FORMAT_A;
      }

      /* if last block has less than WMBUS_BLOCK_SIZE_FORMAT_A bytes */
      if ((nPcktLength - WMBUS_FIRST_BLOCK_SIZE_FORMAT_A) % WMBUS_BLOCK_SIZE_FORMAT_A != 0)
      {
        xCrcResult &= wMBus_Phy_CRC_check(pStartBuffer, pStartBuffer + dataBytesRemaining - 2);

        /* copy/shift by 2 bytes in buffer without CRCs - to LL*/
        for (j = 0; j < dataBytesRemaining - 2; j++)
        {
          *(pStartBuffer - (2 * n_block) + j) = *(pStartBuffer + j);
        }

        nPcktLength_no_CRC = nPcktLength_no_CRC + dataBytesRemaining - 2;
      }
    }
    else if (FrameFormat == WMBUS_FORMAT_B)
    {
      /* CRC verification */
      xCrcResult = TRUE;
      /* check if only second block or optional block to consider */
      if (nPcktLength <= (WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + WMBUS_SECOND_BLOCK_MAX_SIZE_FORMAT_B))
      {
        /* here only 1st + 2nb block => 1 CRC to check */
        xCrcResult = wMBus_Phy_CRC_check(pStartBuffer, pStartBuffer + nPcktLength - 2);
        nPcktLength_no_CRC = nPcktLength - 2;
      }
      else
      {
        /* here 2 CRCs to check : 2nd block + optional block */
        /* 2nd block CRC */
        xCrcResult = wMBus_Phy_CRC_check(pStartBuffer, pStartBuffer + WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + WMBUS_SECOND_BLOCK_MAX_SIZE_FORMAT_B - 2);
        /* optional block CRC */
        xCrcResult &= wMBus_Phy_CRC_check(pStartBuffer + WMBUS_FIRST_BLOCK_SIZE_FORMAT_B + WMBUS_SECOND_BLOCK_MAX_SIZE_FORMAT_B, pStartBuffer + nPcktLength - 2);
        nPcktLength_no_CRC = nPcktLength - 4;
      }
    }
  }

