betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/Phy/Src/stm32wl3_wMBus_Phy_radio.c
  if ((xCrcResult) && (nPcktLength != 0xFFFF))
  {
    wMBus_Radio_Event_bitmap |= WMBUS_RX_COMPLETED_WITH_VALID_CRC;
#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_COMPLETED_WITH_VALID_CRC, nPcktLength, nPcktLength_no_CRC, 0);
#endif
    return nPcktLength_no_CRC;
  }
  else if (nPcktLength == 0xFFFF)
  {
    wMBus_Radio_Event_bitmap |= WMBUS_RX_BUFFER_SIZE_ERROR;
#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_BUFFER_SIZE_ERROR, nPcktLength, nPcktLength_no_CRC, 0);
#endif
    return nPcktLength;
  }
  else
  {
    wMBus_Radio_Event_bitmap |= WMBUS_RX_COMPLETED_WITH_CRC_ERROR;
#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_EVENT_WMBUS_RX_COMPLETED_WITH_CRC_ERROR, nPcktLength, nPcktLength_no_CRC, 0);
#endif
    return 0;
  }
}

uint16_t wMBus_Phy_CRC_calc(uint16_t crcReg, uint8_t crcData)
{
  uint8_t i;

  for (i = 0; i < 8; i++)
  {
    /* If upper most bit is 1 */
    if (((crcReg & 0x8000) >> 8) ^ (crcData & 0x80))
      crcReg = (crcReg << 1) ^ CRC_POLYNOM;
    else
      crcReg = (crcReg << 1);

    crcData <<= 1;
  }

  return crcReg;
}

uint8_t wMBus_Phy_CRC_check(uint8_t *pStart, uint8_t *pStop)
{
  uint16_t seed = 0x0000;

  while (pStart != pStop)
  {
    seed = wMBus_Phy_CRC_calc(seed, *pStart);
    pStart++;
  }
  seed = ~seed;
  if ((pStop[0] == (uint8_t)(seed >> 8)) && (pStop[1] == (uint8_t)(seed)))
  {
    return TRUE;
  }
  return FALSE;
}

void wMBus_Phy_CRC_append(uint8_t *pStart, uint8_t *pStop)
{
  uint16_t seed = 0x0000;
  while (pStart != pStop)
  {
    seed = wMBus_Phy_CRC_calc(seed, *pStart);
    pStart++;
  }
  seed = ~seed;
  pStop[0] = (uint8_t)(seed >> 8);
  pStop[1] = (uint8_t)seed;
}

uint8_t wMBus_Phy_check_radio_events(uint32_t wMBus_RadioEvent_Mask)
{
  if ((wMBus_Radio_Event_bitmap & wMBus_RadioEvent_Mask) == wMBus_RadioEvent_Mask)
  {
    /* clear radio flag event */
    wMBus_Radio_Event_bitmap &= ~wMBus_RadioEvent_Mask;
    return 1;
  }
  else
  {
    return 0;
  }
}

uint8_t wMBus_Phy_register_LL_buffer(uint8_t *RxBuffer, uint16_t *PacketLength_ptr, uint8_t *FrameFormat_ptr, uint32_t *RxSync_ptr, int32_t *RssiDbm_ptr)
{
  /* save LL Rx buffer pointer */
  global_buffer_ptr = RxBuffer;
  /* save LL buffer size pointer - used to report packet size to LL*/
  global_buffer_size_ptr = PacketLength_ptr;
  /* save LL buffer size (allocation) - used to avoid LL buffer corruption */
  global_buffer_allocation = *(PacketLength_ptr);
  /* save LL format */
  global_buffer_format_ptr = FrameFormat_ptr;

  /* save LL Rssi level of Rx buffer */
  global_RssiDbm_ptr = RssiDbm_ptr;

  /* report Rx Sync pattern used for Rx */
  global_RxSync_ptr = RxSync_ptr;

  /* check LL register size vs Radio buffer size : if too small => error */
  if (*PacketLength_ptr < WMBUS_RADIO_BUFFER_SIZE_MAX_NRZ)
  {
    /* error */
    return 1;
  }
  else
  {
    /* no error */
    return 0;
  }
}

uint8_t wMBus_Phy_start_Tx_test_mode(uint8_t Tx_TestMode)
{
  uint8_t TM_success = 0;

  switch (Tx_TestMode)
  {
  case TX_TM_CW:

    /* set CW - no modulation */
    HAL_MRSubG_SetModulation(MOD_CW, 0);

    /* set Test Mode */
    LL_MRSubG_SetTXMode(TX_PN);

    TM_success = SUCCESS;

    /* IRQ Config */
    __HAL_MRSUBG_SET_RFSEQ_IRQ_ENABLE(MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E);

    __HAL_MRSUBG_STROBE_CMD(CMD_TX);
#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_COMMAND_TX_LOG, 0, 0, 0);
#endif

    break;

  case TX_TM_PN9:

    /* just set Test Mode (and keep same modulation as wM-Bus channel) */
    LL_MRSubG_SetTXMode(TX_PN);

    TM_success = SUCCESS;

    /* IRQ Config */
    __HAL_MRSUBG_SET_RFSEQ_IRQ_ENABLE(MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_SABORT_DONE_E);

    __HAL_MRSUBG_STROBE_CMD(CMD_TX);
#ifdef WMBUS_DEBUG
    wMBus_Phy_trace_debug_log(DEBUG_COMMAND_TX_LOG, 0, 0, 0);
#endif
    break;

  default:

    TM_success = ERROR;
    break;
  }

  return TM_success;
}

uint8_t wMBus_Phy_stop_Tx_test_mode(void)
{
  __HAL_MRSUBG_STROBE_CMD(CMD_SABORT);
#ifdef WMBUS_DEBUG
  wMBus_Phy_trace_debug_log(DEBUG_COMMAND_SABORT_LOG, 0, 0, 0);
#endif

  /* wait for SABORT IRQ confirmation */
  while (!xSabortCompletedFlag);

  xSabortCompletedFlag = RESET;

  return SUCCESS;
}

int32_t wMBus_Phy_sense_rssi(uint32_t RxTimeoutMicrosec)
{
  /* IRQ Config */
  __HAL_MRSUBG_SET_RFSEQ_IRQ_ENABLE(MR_SUBG_GLOB_DYNAMIC_RFSEQ_IRQ_ENABLE_RX_TIMEOUT_E);

  /* start Rx timer without any Stop condition */
  wMBus_Phy_start_RxTimer(RxTimeoutMicrosec, 0);

  /* wait for Rx timeout event */
  while (!wMBus_Phy_check_radio_events(WMBUS_RX_TIMEOUT));

  /* return Rssi Dbm value */
  return HAL_MRSubG_GetRssidBm();
}

#ifdef WMBUS_RX_PERFORMANCE_ENABLED
void wMBus_Phy_Rx_performance_settings(uint8_t wMBus_mode, uint8_t wMBus_Direction)
{
  /* optimize RSSI threshold setting */
  LL_MRSubG_SetRssiThresholdRegister(wMBus_Phy_Rx_RssiThreshold[wMBus_mode][wMBus_Direction]);

  /* optimize Clock Recovery settings */;
  LL_MRSubG_SetClkRecCtrl0(wMBus_Phy_Rx_ClkRec[wMBus_mode][wMBus_Direction][0]);
  LL_MRSubG_SetClkRecCtrl1(wMBus_Phy_Rx_ClkRec[wMBus_mode][wMBus_Direction][1]);

  /* set RSSI_FLT register */
  LL_MRSubG_SetRSSIFilter(0xE3);

  /* only validated for T/S/C and even N - 2-FSK 868MHz modes */
  /* optimize AFC3 register to avoid residual PER */
  LL_MRSubG_SetAFC3(0xE9);

#ifdef STM32WL33XA
  if (wMBus_mode == N_MODE_Ng)
  {
    /* specific AFC settings */
    LL_MRSubG_SetAFC0(0x67);
    LL_MRSubG_SetAFC1(0x00);
    LL_MRSubG_SetAFC2(0x68);
    LL_MRSubG_SetAFC3(0xA8);
  }
#endif
}
#endif

#ifdef WMBUS_ACTIVE_POWER_MODE_ENABLED
void wMBus_Phy_set_active_power_mode(uint8_t Active_PM)
{
  switch (Active_PM)
  {
  case WMBUS_LPM:
    /* in that case LPM means :
      - 1.2v SMPS
      - RF LDO bypassed
    */

    /* set SMPS level @ 1.2v */
    HAL_PWREx_ConfigSMPS_Update(LL_PWR_SMPS_OUTPUT_VOLTAGE_1V20, PWR_CR5_SMPSBOMSEL_1);

    /* bypass RF LDO */
    SET_BIT(PWR->CR2, PWR_CR2_RFREGBYP);

    break;
  case WMBUS_HPM:
    /* in that case HPM means :
      - 1.4v SMPS
      - RF LDO NOT bypassed
    */

    /* NOT bypass RF LDO */
    CLEAR_BIT(PWR->CR2, PWR_CR2_RFREGBYP);

    /* set SMPS level @ 1.4v */
    HAL_PWREx_ConfigSMPS_Update(LL_PWR_SMPS_OUTPUT_VOLTAGE_1V40, PWR_CR5_SMPSBOMSEL_1);

    break;

  case WMBUS_SMPS_BYPASS_STATIC:
    LL_PWR_DBGSMPS_Current_Selection(0);

