betoslava/STM32WL33_Radio_Modular/STM32Cube_FW_WL3_V1.3.0/Middlewares/ST/wMBus/Phy/Src/stm32wl3_wMBus_Phy_radio.c
    LL_PWR_EnableSMPSBOFStatic();
    LL_PWR_EnableSMPSBOF();

    break;
  default:
    break;
  }
}
#endif

#ifdef WMBUS_DEBUG
void wMBus_Phy_initialize_debug_log(void)
{
  uint8_t i = 0;

  for (i = 0; i < WMBUS_LOG_BUFFER_SIZE; i++)
  {
    wMBus_debug_log[i].Timestamp = 0;
    wMBus_debug_log[i].event = 0;
    wMBus_debug_log[i].debug_info1 = 0;
    wMBus_debug_log[i].debug_info2 = 0;
    wMBus_debug_log[i].debug_info3 = 0;
  }

  wMBus_debug_log_index = 0;
}

void wMBus_Phy_trace_debug_log(uint32_t event, uint32_t debug_info1, uint32_t debug_info2, uint32_t debug_info3)
{
  wMBus_debug_log[wMBus_debug_log_index].Timestamp = HAL_GetTick();
  wMBus_debug_log[wMBus_debug_log_index].event = event;
  wMBus_debug_log[wMBus_debug_log_index].debug_info1 = debug_info1;
  wMBus_debug_log[wMBus_debug_log_index].debug_info2 = debug_info2;
  wMBus_debug_log[wMBus_debug_log_index].debug_info3 = debug_info3;

  wMBus_debug_log_index++;

  if (wMBus_debug_log_index == WMBUS_LOG_BUFFER_SIZE)
  {
    wMBus_debug_log_index = 0;
  }
}
#endif

#ifdef WMBUS_FIRST_CRC_CHECK
uint8_t wMBus_Phy_first_CRC_check(void)
{
  /* copy Radio Buffer into Copy buffer */
  uint8_t i = 0;

  if (wMBus_Format_global != WMBUS_FORMAT_B)
  {
    /* copy into vectcRadioBuff_copy[] for CRC analysis
       if T+C mode and T-mode then perform 3o6 decoding by Sw */

    /* check first cases where only single modes are selected */
#if !defined(T1C1_ACTIVATED) && !defined(T1C1_ACTIVATED_C1_MODE)
#ifndef AUTOMATIC_FORMAT_DETECTION_C_MODE
    /* here no C-mode dynamic format, so copy directly NRZ bytes to vectcRadioBuff_copy[] */
    /* copy WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes (12) */
    for (i = 0; i < WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i++)
    {
      vectcRadioBuff_copy[i] = vectcRadioBuff[i];
    }
#else
    /* here C-mode dynamic format to handle - if it is the case */
    /* check if C-mode requested + A_B format only and A format detected
       (then copy starting from 2nd Rx byte - otherwise copy from 1st byte */
    /* copy using NRZ */
    /* copy WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes (12) */
    if ((wMBus_mode_global == C_MODE) && (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A) && (wMBus_Format_global == WMBUS_FORMAT_A_B))
    {
      for (i = 0; i < WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i++)
      {
        vectcRadioBuff_copy[i] = vectcRadioBuff[i + 1];
      }
    }
    else if ((wMBus_mode_global == C_MODE) && (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_B))
    {
      return 1; // declare CRC Ok to not check CRC in case Frame Format B detected
    }
    else
    {
      /* other cases :
        - C-mode + A-format requested
        - S-mode
        - T-mode */
      for (i = 0; i < WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i++)
      {
        vectcRadioBuff_copy[i] = vectcRadioBuff[i];
      }
    }
#endif
#else // here need to manage T+C modes : so we have to check effective Rx mode and frame format
    if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_C_MODE_M2O_FORMAT_A)
    {
      /* here C-mode dynamic format to handle - if it is the case */
      /* check if C-mode (then copy starting from 3rd Rx byte */
      /* copy using NRZ */
      /* copy WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes (12) */
      for (i = 0; i < WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i++)
      {
        vectcRadioBuff_copy[i] = vectcRadioBuff[i + 2];
      }
    }
    else if (RxSync_Ongoing == WMBUS_SYNC_PATTERN_T_MODE_M2O)
    {
      /* here T-mode format to handle - if it is the case */
      /* perform 3o6 Sw decoding 3 bytes in -> 2 bytes out to copy */
      /* output : WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes (12) */

      uint16_t tos_q_tgt = WMBUS_FIRST_BLOCK_SIZE_FORMAT_A + 6; // 12 NRZ bytes = 18 3o6 bytes

      tos_q_head = 0; // 1st 3o6 RAW byte to decode
      tos_q_tail = 0; // 1st decoded byte to write

      /* indexes of RAW 3o6 buffer */
      tos_q_done_head = 0;

      while (tos_q_done_head < tos_q_tgt)
      {
        ToS_decode(&vectcRadioBuff[tos_q_head], tos_out);

        tos_q_head = tos_q_head + 3;
        tos_q_done_head += 3;

        for (uint8_t j = 0; j < 2; j++)
        {
          vectcRadioBuff_copy[tos_q_tail] = tos_out[j];
          tos_q_tail++;
        }
      }
    }
    else
    /* other cases (S mode) : just copy NRZ bytes buffer to buffer */
    {
      for (i = 0; i < WMBUS_FIRST_BLOCK_SIZE_FORMAT_A; i++)
      {
        vectcRadioBuff_copy[i] = vectcRadioBuff[i];
      }
    }
#endif
    /* here vectcRadioBuff_copy[] is done with WMBUS_FIRST_BLOCK_SIZE_FORMAT_A bytes */
    /* check CRC */
    /* CRC verification */
    /* CRC result */
    uint8_t xCrcResult = TRUE;

    /* check 1st block CRC */
    xCrcResult = wMBus_Phy_CRC_check(&vectcRadioBuff_copy[0], &vectcRadioBuff_copy[WMBUS_FIRST_BLOCK_SIZE_FORMAT_A - 2]);

    /* CRC OK if xCrcResult = 1
       CRC KO if xCrcResult = 0 */
    return xCrcResult;
  }
  else
  {
    /* do not check CRC for frame format B */
    return 1;
  }
}
#endif

/**
  * @}
  */

/** @defgroup Radio_Private_Functions Radio Private Functions
  * @{
  */
void wMBus_Phy_MRSubG_MspInit(void)
{
  /* Peripheral clock enable */
  if (__HAL_RCC_MRSUBG_IS_CLK_DISABLED())
  {
    /* MRSUBG Peripheral reset */
    __HAL_RCC_MRSUBG_FORCE_RESET();
    __HAL_RCC_MRSUBG_RELEASE_RESET();
    
    /* Enable MRSUBG peripheral clock */
    __HAL_RCC_MRSUBG_CLK_ENABLE();
  }

  /* MRSUBG interrupt Init*/
  HAL_NVIC_SetPriority(MRSUBG_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(MRSUBG_IRQn);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
